Практос_2/src/Documents/ЗакрытиеВакансии/ЗакрытиеВакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеВакансии</name>
  <basedOn>Document.ПубликацияВакансии</basedOn>
  <registerRecords>AccumulationRegister.ПланВакансий</registerRecords>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗакрытия</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗакрытияОтмены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
</mdclass:Document>

Практос_2/src/AccumulationRegisters/ПланВакансий/ПланВакансий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланВакансий</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиенты</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вакансии</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Практос_2/src/Documents/ЗакрытиеВакансии/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПланВакансий Расход
	Движения.ПланВакансий.Записывать = Истина;
	Движение = Движения.ПланВакансий.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Клиенты = Организация;
	Движение.Вакансии = Вакансия;
	Движение.Количество  = 1;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПубликацияВакансии") Тогда
		// Заполнение шапки
		Вакансия = ДанныеЗаполнения.Вакансия;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		СтатусЗакрытия = ДанныеЗаполнения.Статус;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
